# UBER DRIVE ANALYSIS

Description : The project is based on the trips made by Uber drivers. Different aspects of the trip are analyzed by using different functions in Python.

Skills & Tools Covered : Python Functions and Data Interpretation.

In [1]:
# Importing required librries

import numpy as np
import pandas as pd
import os
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Check the path using os and load the Data in the datafreame using pandas

print(os.getcwd())

uber_drives = pd.read_csv(r'C:\Users\shubh\Data_Science\Projects - Dataset and Notebooks\Project 1\ud_data.csv')

C:\Users\shubh\Data_Science\Projects - Dataset and Notebooks\Project 1

In [3]:
# check the head of the dataset

uber_drives.head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [4]:
# check the tail of the dataset

uber_drives.tail(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Karachi,Karachi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [5]:
# Check the shape (number of rows and columns)

uber_drives.shape

(1155, 7)

In [6]:
# check the size (rows * columns)

uber_drives.size

8085

In [7]:
# check the info

uber_drives.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1155 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [8]:
# checking the missing values in the dataset in the boolean(True or False) format

uber_drives.isnull()

      START_DATE*  END_DATE*  CATEGORY*  START*  STOP*  MILES*  PURPOSE*
0           False      False      False   False  False   False     False
1           False      False      False   False  False   False      True
2           False      False      False   False  False   False     False
3           False      False      False   False  False   False     False
4           False      False      False   False  False   False     False
...           ...        ...        ...     ...    ...     ...       ...
1150        False      False      False   False  False   False     False
1151        False      False      False   False  False   False     False
1152        False      False      False   False  False   False     False
1153        False      False      False   False  False   False     False
1154        False      False      False   False  False   False     False

[1155 rows x 7 columns]

In [9]:
# displaying the total number of missing values in each of the variables separately

uber_drives.isnull().sum()

START_DATE*      0
END_DATE*        0
CATEGORY*        0
START*           0
STOP*            0
MILES*           0
PURPOSE*       502
dtype: int64

### Analysis: As we can see clearly that the total null values in the dataset are 502 and those are only in 'Purpose' column. That means 502 drives have not mentioned the purpose in the given dataset. The question arises that whether we should drop these missing values or fill it with some values manually. But it is completely dependent on the analysis that we want to do. Let's first explore tha other insights about the data.

In [10]:
# Summary of the original data including : Count,Mean, Std, Min, 25%,50%,75% and max

# Since, the only numeric column in the dataset is 'miles', so the default summmary is shwon only for that column

uber_drives.describe()

            MILES*
count  1155.000000
mean     10.566840
std      21.579106
min       0.500000
25%       2.900000
50%       6.000000
75%      10.400000
max     310.300000

In [11]:
# explore the 'purpose' column before dropping the missing values

print('Total distint Purpose mentioned :',uber_drives['PURPOSE*'].nunique())
uber_drives['PURPOSE*'].unique()

Total distint Purpose mentioned : 10

array(['Meal/Entertain', nan, 'Errand/Supplies', 'Meeting',
       'Customer Visit', 'Temporary Site', 'Between Offices',
       'Charity ($)', 'Commute', 'Moving', 'Airport/Travel'], dtype=object)

In [12]:
uber_drives['PURPOSE*'].value_counts()

PURPOSE*
Meeting            187
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Commute              1
Charity ($)          1
Name: count, dtype: int64

### Analysis : Dropping 502 out of 1,155 entries means losing nearly 43% of your data, which can skew insights and reduce statistical power. Instead of discarding them, we have to find the smarter ways to handle the missing 'Purpose' values.

In [13]:
# let's impute the missing values in purpose column with 'unknown' 

uber_drives['PURPOSE*'] = uber_drives['PURPOSE*'].fillna('Unknown')

In [14]:
uber_drives.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1155 non-null   float64
 6   PURPOSE*     1155 non-null   object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

### We have replaced the null values in the purpose column with 'unknown'. So, now there are no missing values in the dataset.

In [15]:
uber_drives['PURPOSE*'].value_counts()

PURPOSE*
Unknown            502
Meeting            187
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Commute              1
Charity ($)          1
Name: count, dtype: int64

In [16]:
uber_drives.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [17]:
uber_drives.columns = uber_drives.columns.str.replace('*', '', regex=False)

In [18]:
uber_drives.columns

Index(['START_DATE', 'END_DATE', 'CATEGORY', 'START', 'STOP', 'MILES',
       'PURPOSE'],
      dtype='object')

In [19]:
uber_drives.head(3)

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,Unknown
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies

In [20]:
dups = uber_drives[uber_drives.duplicated()]

dups

          START_DATE         END_DATE  CATEGORY   START  STOP  MILES  PURPOSE
492  6/28/2016 23:34  6/28/2016 23:59  Business  Durham  Cary    9.9  Meeting

In [21]:
print(f"Total duplicate rows: {dups.shape[0]}")

Total duplicate rows: 1

In [22]:
uber_drives = uber_drives.drop_duplicates()

In [23]:
uber_drives.shape

(1154, 7)

## Now the data is cleaned :
1. Missing values imputed
2. Dropped dupliactes
3. Renamed the columns and removed the * character

In [24]:
# getting the unique START places names

print(uber_drives['START'].unique())

['Fort Pierce' 'West Palm Beach' 'Cary' 'Jamaica' 'New York' 'Elmhurst'
 'Midtown' 'East Harlem' 'Flatiron District' 'Midtown East'
 'Hudson Square' 'Lower Manhattan' "Hell's Kitchen" 'Downtown' 'Gulfton'
 'Houston' 'Eagan Park' 'Morrisville' 'Durham' 'Farmington Woods'
 'Whitebridge' 'Lake Wellingborough' 'Fayetteville Street' 'Raleigh'
 'Hazelwood' 'Fairmont' 'Meredith Townes' 'Apex' 'Chapel Hill'
 'Northwoods' 'Edgehill Farms' 'Tanglewood' 'Preston' 'Eastgate'
 'East Elmhurst' 'Jackson Heights' 'Long Island City' 'Katunayaka'
 'Unknown Location' 'Colombo' 'Nugegoda' 'Islamabad' 'R?walpindi'
 'Noorpur Shahan' 'Heritage Pines' 'Westpark Place' 'Waverly Place'
 'Wayne Ridge' 'Weston' 'East Austin' 'West University' 'South Congress'
 'The Drag' 'Congress Ave District' 'Red River District' 'Georgian Acres'
 'North Austin' 'Coxville' 'Convention Center District' 'Austin' 'Katy'
 'Sharpstown' 'Sugar Land' 'Galveston' 'Port Bolivar' 'Washington Avenue'
 'Briar Meadow' 'Latta' 'Jacksonville' 'Couples Glen' 'Kissimmee'
 'Lake Reams' 'Orlando' 'Sand Lake Commons' 'Sky Lake' 'Daytona Beach'
 'Ridgeland' 'Florence' 'Meredith' 'Holly Springs' 'Chessington'
 'Burtrose' 'Parkway' 'Mcvan' 'Capitol One' 'University District'
 'Seattle' 'Redmond' 'Bellevue' 'San Francisco' 'Palo Alto' 'Sunnyvale'
 'Newark' 'Menlo Park' 'Old City' 'Savon Height' 'Kilarney Woods'
 'Townes at Everett Crossing' 'Huntington Woods' 'Seaport'
 'Medical Centre' 'Rose Hill' 'Soho' 'Tribeca' 'Financial District'
 'Oakland' 'Emeryville' 'Berkeley' 'Kenner' 'CBD' 'Lower Garden District'
 'Lakeview' 'Storyville' 'New Orleans' 'Metairie' 'Chalmette' 'Arabi'
 'Pontchartrain Shores' 'Marigny' 'Covington' 'Mandeville'
 'Jamestown Court' 'Summerwinds' 'Parkwood' 'Pontchartrain Beach'
 'St Thomas' 'Banner Elk' 'Elk Park' 'Newland' 'Boone' 'Stonewater'
 'Lexington Park at Amberly' 'Arlington Park at Amberly' 'Arlington'
 'Kalorama Triangle' 'K Street' 'West End' 'Connecticut Avenue'
 'Columbia Heights' 'Washington' 'Wake Forest' 'Lahore' 'Karachi'
 'SOMISSPO' 'West Berkeley' 'North Berkeley Hills' 'San Jose' 'Eagle Rock'
 'Winston Salem' 'Asheville' 'Topton' 'Hayesville' 'Bryson City' 'Almond'
 'Mebane' 'Agnew' 'Cory' 'Renaissance' 'Santa Clara' 'NOMA' 'Sunnyside'
 'Ingleside' 'Central' 'Tenderloin' 'College Avenue' 'South' 'Southside'
 'South Berkeley' 'Mountain View' 'El Cerrito' 'Krendle Woods' 'Wake Co.'
 'Fuquay-Varina' 'Rawalpindi' 'Katunayake' 'Gampaha']

In [25]:
# displaying total number of unique START destinations of original dataframe 'uber_drives'

uber_drives['START'].nunique()

176

In [26]:
# displaying total number of unique STOP destinations of original dataframe 'uber_drives'

uber_drives['STOP'].nunique()

187

In [27]:
# Create a copy 
uber_drives_new = uber_drives.copy()

# set START column as index 
uber_drives_new.set_index('START', inplace=True)

# selecting the rows which has starting point of San Francisco using loc function and assign it to new variable
uber_trips_SF = uber_drives_new.loc['San Francisco']

# displaying all the uber trips that has starting point of San Francisco
uber_trips_SF

,START_DATE,END_DATE,CATEGORY,STOP,MILES,PURPOSE
START,,,,,,
San Francisco,5/9/2016 14:39,5/9/2016 15:06,Business,Palo Alto,20.5,Between Offices
San Francisco,6/14/2016 16:09,6/14/2016 16:39,Business,Emeryville,11.6,Meeting
San Francisco,10/19/2016 14:02,10/19/2016 14:31,Business,Berkeley,10.8,Unknown
San Francisco,11/7/2016 19:17,11/7/2016 19:57,Business,Berkeley,13.2,Between Offices
San Francisco,11/8/2016 12:16,11/8/2016 12:49,Business,Berkeley,11.3,Meeting
San Francisco,11/9/2016 18:40,11/9/2016 19:17,Business,Oakland,12.7,Customer Visit
San Francisco,11/10/2016 15:17,11/10/2016 15:22,Business,Oakland,9.9,Temporary Site
San Francisco,11/15/2016 20:44,11/15/2016 21:00,Business,Berkeley,11.8,Temporary Site

In [28]:
# First copying the original dataframe into another dataframe named 'uber_drives_3'
uber_drives_new_1 = uber_drives.copy()

print('The most popular starting point for the Uber drivers is:', uber_drives_new_1['START'].value_counts().idxmax())
print('_____________________')
print('See the below data to verify:\n\n', uber_drives_new_1['START'].value_counts())

The most popular starting point for the Uber drivers is: Cary
_____________________
See the below data to verify:

 START
Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
                   ...
El Cerrito            1
Wake Co.              1
Fuquay-Varina         1
Katunayake            1
Gampaha               1
Name: count, Length: 176, dtype: int64

In [29]:
# First copying the original dataframe into another dataframe named 'uber_drives_4'
uber_drives_new_2 = uber_drives.copy()

print('The most popular dropping point for the Uber drivers is:', uber_drives_new_2['STOP'].value_counts().idxmax())
print('_________________________')
print('See the below data to verify:\n\n', uber_drives_new_2['STOP'].value_counts())

The most popular dropping point for the Uber drivers is: Cary
_________________________
See the below data to verify:

 STOP
Cary                202
Unknown Location    149
Morrisville          84
Whitebridge          65
Islamabad            58
                   ...
Mountain View         1
Wake Co.              1
Fuquay-Varina         1
Gampaha               1
Ilukwatta             1
Name: count, Length: 187, dtype: int64

In [31]:
# Create a new column that combines START and STOP
uber_drives['ROUTE'] = uber_drives['START'] + " → " + uber_drives['STOP']

# Get the most frequent route
most_frequent_route = uber_drives['ROUTE'].value_counts().idxmax()
route_count = uber_drives['ROUTE'].value_counts().max()

print(f"Most frequent route: {most_frequent_route} ({route_count} times)")

Most frequent route: Unknown Location → Unknown Location (86 times)

In [33]:
uber_drives

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,ROUTE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Fort Pierce → Fort Pierce
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,Unknown,Fort Pierce → Fort Pierce
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Fort Pierce → Fort Pierce
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Fort Pierce → Fort Pierce
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Fort Pierce → West Palm Beach
...,...,...,...,...,...,...,...,...
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Karachi,Karachi,0.7,Meeting,Karachi → Karachi
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site,Karachi → Unknown Location
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting,Unknown Location → Unknown Location
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site,Katunayake → Gampaha
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site,Gampaha → Ilukwatta

In [34]:
uber_drives['START'].value_counts()['Unknown Location']

np.int64(148)

In [35]:
uber_drives['STOP'].value_counts()['Unknown Location']

np.int64(149)

In [36]:
# Get top 3 most frequent routes
top_routes = uber_drives['ROUTE'].value_counts().head(3)

print("Top 3 most frequent routes:")
print(top_routes)

Top 3 most frequent routes:
ROUTE
Unknown Location → Unknown Location    86
Morrisville → Cary                     75
Cary → Morrisville                     67
Name: count, dtype: int64

In [37]:
#displaying all types of purposes for the trip in an array from the dataframe 'df' with no 'NA' values

ptype = uber_drives['PURPOSE'].unique()

np.array(ptype)

array(['Meal/Entertain', 'Unknown', 'Errand/Supplies', 'Meeting',
       'Customer Visit', 'Temporary Site', 'Between Offices',
       'Charity ($)', 'Commute', 'Moving', 'Airport/Travel'], dtype=object)

In [39]:
uber_drives['PURPOSE'] = uber_drives['PURPOSE'].str.replace('($)', '', regex=False).str.strip()

In [40]:
uber_drives['PURPOSE'].value_counts()

PURPOSE
Unknown            502
Meeting            186
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Commute              1
Charity              1
Name: count, dtype: int64

In [42]:
# Group by Purpose and sum the miles
purpose_miles = uber_drives.groupby('PURPOSE')['MILES'].sum().sort_values(ascending=False)

# Display the top purpose
top_purpose = purpose_miles.idxmax()
top_miles = purpose_miles.max()

print(f"Most miles were driven for: {top_purpose} ({top_miles:.2f} miles)")

Most miles were driven for: Unknown (4893.50 miles)

In [ ]:
uber_drives.groupby(['PURPOSE*']).sum()

new_dataset = {'Airport/Travel':16.5, 'Between Offices':197.0, 'Charity($)':15.1, 'Commute':180.2, 'Customer Visit':2089.5, 
              'Errand/Supplies':508.0, 'Meal/Entertain':911.7, 'Meeting':2851.3, 'Moving':18.2, 'Temporary Site':523.7} 


purpose = list(new_dataset.keys()) 
miles = list(new_dataset.values()) 

fig = plt.figure(figsize = (17, 10))

plt.bar(purpose, miles, color ='green', width = 0.4)
plt.title("Total/Sum miles per purpose")
plt.xlabel("PURPOSE") 
plt.ylabel("MILES") 
 
plt.show()

In [ ]:
# Displaying a dataframe of Purpose and the distance travelled for that particular Purpose

uber_drives.groupby(['PURPOSE*']).sum()

In [ ]:
uber_drives.groupby(['CATEGORY*']).groups

In [ ]:
total_miles = uber_drives['MILES*'].sum()    # sum of miles = 12204.7
print('Total Miles = ',total_miles)

print('______________________')

miles_per_category = uber_drives.groupby(['CATEGORY*']).sum()

print('\nMiles per category are shown as below = \n\n', miles_per_category)

print('______________________')

#Proportion of miles covered as business trips= (Total Miles clocked as Business Trips)/ (Total Miles)

Proportion_of_miles_covered_as_business_trips = (11487.0)/(12204.7)
print('Proportion of miles covered as business trips: ',Proportion_of_miles_covered_as_business_trips)

print('______________________')

#Proportion of miles covered as personal trips= (Total Miles clocked as Personal Trips)/ (Total Miles)

Proportion_of_miles_covered_as_personal_trips = (717.7)/(12204.7)
print('Proportion of miles covered as personal trips: ',Proportion_of_miles_covered_as_personal_trips)